app/controllers/posts_controller.rb

  def update
    @post.update!(content: params[:post][:content])
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "foo"], ["updated_at", "2018-03-26 10:06:04.427761"], ["id", 1]]

  def find_post!
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]